import { WEBSITE_URL } from '@/utils/constants';

export const paragraphs = [
  {
    title: '活動內容',
    content: /*html*/ `
    10/10～10/31 活動期間至基隆文化中心前廣場與任一傘人家族成員合照，合照對象不限(人、竉物、玩偶、玩具…皆可)，再至活動網站，選擇一張合照並附上一句話，上傳作品，即完成參賽，活動結束後將選出前三名最有創意的照片，贈予精美獎品。<br />
    <br />
    第一名：LEICA SOFORT 2 拍立得相機<br />
    第二名：Polaroid Now+ 拍立得相機<br />
    第三名：FUJIFILM instax SQUARE SQ1<br />
    <br />
    ＂<b>限於活動現場</b>＂完成參賽後，分享活動網站於個人 IG 或 FB
    並追蹤基隆市文化觀光局臉書，經現場工作人員確認無誤後，將可獲得活動特製傘人家族精緻小物一個（二款隨機贈送，一人限領取一個，每日限量，送完為止）。`,
  },
  {
    title: '參賽辦法',
    content: /*html*/ `
    <ul>
      <li>作品限用手機拍攝，不限手機品牌。</li>
      <li>
        主題內容不限，唯必須與傘人家族任一成員合照，合照對象不限
        (人、竉物、玩偶、玩具…皆可)，但照片內容不可違反公序良俗，如有違背，主辦單位有權下架作品不另行通知。
      </li>
      <li>
        參賽作品需在基隆文化中心前廣場傘人攝影活動場地拍攝之照片，且同意授權主辦單位於平台宣傳、展示使用權利。
      </li>
      <li>
        每人至多可上傳三張照片參賽，每張照片檔案不可小於 1,200 萬畫素，⻑寬⽐為
        4:3 的 JPEG 檔。
      </li>
      <li>
        作品後製僅限用手機調整明暗對⽐、色彩、裁切；禁止數位合成、加字、彩繪、疊片等。
      </li>
      <li>
        每張照⽚須附上 50 字以內之敘述，文字內容禁止使用低俗、淫穢、
        粗鄙等不雅文字，如違反規定，主辦單位有權下架作品不另行通知。
      </li>
    </ul>`,
  },
  {
    title: '收件期間',
    content: /*html*/ `
    2024 年 10 月 10 日至 10 月 31日止，逾期者恕不受理。
    `,
  },
  {
    title: '收件方式',
    content: /*html*/ `
      一律於活動網站，上傳作品。<br />
    `,
  },
  {
    title: '評分方式',
    content: /*html*/ `
      邀請基隆市政府文化觀光局人員及網紅伊米塔擔任評審，選出前三名作品。<br />
      評分項目：創意：60%、文案：30%、品質：10%。
    `,
  },
  {
    title: '得獎公佈',
    content: /*html*/ `
      11 月 11 日將於<b>一起「傘人」1～2～3！活動網站、文化觀光局臉書、魅力基隆臉書</b>公佈前三名得獎名單，並通知得獎者領獎。 
    `,
  },
  {
    title: '注意事項',
    content: /*html*/ `
    <ol>
      <li>凡上傳作品完成報名參加本活動者，即視為已充分瞭解本辦法中各項條款，且願意完全遵守本活動之各項規定。</li>
      <li>參賽作品不得含有任何具挑釁、猥褻、毀謗、暴力、情色、種族歧視性或其他任何引人厭惡或不合宜之內容，主辦單位得自行判斷並有權下架作品不另行通知。 </li>
      <li>參賽作品開放供民眾下載收藏，但不得侵害其作者著作權及相關利益，如有違反，須自負法律責任。</li>
      <li>主辦單位保留隨時修正、暫停、終止或解釋本活動之一切及最終權利（包括但不限於更換活動、提前終止或延⻑活動時間之最終決定權等事項），相關內容如有變動將於比賽活動網站及文化觀光局臉書另行公告，不另行通知，若有任何異動，以本競賽活動官方網站最新公告為準。</li>
      <li>若得獎獎項價值累計超過新台幣 1,001 元(含)以上者而未滿 18 歲之中獎者，視同父母或監護人中獎，由父母或監護人代為領獎，並請附上得獎者及其代領人關係證明影本。 </li>
      <li>本活動如有任何因電腦、網路、技術或其他不可歸責於主辦單位之事由，而使活動參加者所登錄之資料有所遺失、錯誤、無法辨識或毀損所導致資料無效之狀況，主辦單位不負任何法律責任，本活動參加者及獲採用者亦不得異議。
      如發生前述情形，主辦單位將不做任何通知。 </li>
      <li>本活動參加者應聲明及保證其所填寫或提出之資料均為真實，且未冒用或盜用任何第三人之資料，如冒用或盜用任何第三人資料之法律責任由該參加者自行負擔，概與主辦單位無關，參賽者保證所有填寫或提出之資料均為真實且正確，且未冒用或盜用任何第三人之資料。
      如有不實或不正確之情事，將被取消參加或得獎資格。如因此導致主辦單位無法通知其得獎訊息時，主辦單位不負任何責任，且如有致損害於主辦單位或其他任何第三人，參賽者應自負一切相關責任。</li>
      <li>參賽者在參賽之同時，即代表參賽者同意且未違反與第三者之協議、保證參賽作品未侵犯其他任何個人或實體之版權、商標權、人格權、隱私／公開權、以及智慧財產權，且未有第三者對該參賽作品具備任何權利、所有權、主張擁有或相關利益，亦未有違反其他法令情事。
      如有違反之虞，主辦單位得立即移除相關內容，並取消其參賽與得獎資格，並追回一切獎項，且參賽者須自負法律責任。 </li>
      <li>參賽者應尊重評審觀點，對於評審結果不得異議，經評審得獎確定之作品，不得要求取消得獎資格。 </li>
      <li>若主辦單位因使用參賽者所提供之圖文、照片及其他資料遭第三人請求、索賠、提出民、刑事訴訟或主張任何法律上之權利，參賽者應賠償主辦單位因此所生之全部損失與費用。 </li>
      <li>參賽者如因參加本活動或因活動獎項而遭受任何損失，主辦單位不負任何責任。一旦得獎者領取獎品後，若有遺失或被竊，主辦單位不發給任何證明或補償。 </li>
      <li>本辦法若有其他未盡事宜，悉依主辦單位相關規定或解釋辦理，主辦單位保有最終之解釋權。 </li>
    </ol>
    `,
  },
  {
    title: '聯絡窗口',
    content: /*html*/ `
      詹先生<br/>
      電話：02-2857-5568 （時間：週一至周五，10:00-17:00）<br/>
      信箱：91.inwheel@gm.tut.edu.tw  
    `,
  },
];
