export const REQUIRED_FIELD_MESSAGE = '此欄位不得為空';

export const requiredLengthText = (text, num) => {
  return `${text}必須是 ${num} 個字元`;
};

export const invalidFormat = (text) => {
  return `${text}格式不正確`;
};

export const overMaxLength = (num) => {
  return `此欄位不得超過 ${num} 個字`;
};

export const noticeList = [
  '凡上傳作品完成報名參加本活動者，即視為已充分瞭解本辦法中各項條款，且願意完全遵守本活動之各項規定。',
  '參賽作品不得含有任何具挑釁、猥褻、毀謗、暴力、情色、種族歧視性或其他任何引人厭惡或不合宜之內容，主辦單位得自行判斷並 有權下架作品不另行通知 。',
  '主辦單位保留隨時修正、暫停、終止或解釋本活動之一切及 最 終權利（包括但不限於更換活動、提前終止或延長活動時間之 最 終決定權等事項），相關內容如有變動將於 比賽 活動 網 站 及 文化觀光局臉書 另行公告，不另行通知， 若有任何異動，以本競賽活動官方網站最新公告為準。',
  '若得獎獎項價值累計超過新台幣 1,001 元 含 以上者而未滿 1 8 歲之中獎者，視同父母或監護人中獎，由父母或監護人代為領獎，並請附上得獎者及其代領人關係證明影本。',
  '本活動如有任何因電腦、網路、技術或其他不可歸責於主辦單位之事由，而使活動參加者所登錄之資料有所遺失、錯誤、無法辨識或毀損所導致資料無 效之狀況，主辦單位不負任何法律責任，本活動參加者及獲採用者亦不得異議。如發生前述情形，主辦單位將不做任何通知。',
  '本活動參加者應聲明及保證其所填寫或提出之資料均為真實，且未冒用或盜用任何第三人之資料，概與主辦單位無關，參賽者保證所有填寫或提出之資料均為真實且正確，且未冒用或盜用任何第三人之資料。如有不實或不正確之情事，將被被取消參加或得獎資格。如因此導致主辦單位無法通知其得獎訊息時，主辦取消參加或得獎資格。如因此導致主辦單位無法通知其得獎訊息時，主辦單位不負任何責任，且如有致損害於主辦單位或其他任何第三人，參賽者應自負一切相關責任。自負一切相關責任。',
  '參賽者在參賽之同時，即代表參賽者同意且未違反與第三者之協議、保證參賽作品未侵犯其他任何個人或實體之版權、商標權、人格權、隱私／公開權、以及智慧財產權，且未有第三者對該參賽作品具備任何權利、所有權、權、以及智慧財產權，且未有第三者對該參賽作品具備任何權利、所有權、主張擁有或相關利益，亦未有違反其他法令情事。如有違反之虞，主辦單位主張擁有或相關利益，亦未有違反其他法令情事。如有違反之虞，主辦單位得立即移除相關內容，並取消其參賽與得獎資格，並追回一切獎項，且參賽得立即移除相關內容，並取消其參賽與得獎資格，並追回一切獎項，且參賽者須自負法律責任。者須自負法律責任。',
  '參賽者應尊重評審觀點，對於評審結果不得異議，經評審得獎確定之作品，參賽者應尊重評審觀點，對於評審結果不得異議，經評審得獎確定之作品，不得要求取消得獎資格。不得要求取消得獎資格。',
  '若主辦單位因使用參賽者所提供之圖文、照片及其他資料遭第三人請求、索若主辦單位因使用參賽者所提供之圖文、照片及其他資料遭第三人請求、索賠、提出民、刑事訴訟或主張任何法律上之權利，參賽者應賠償主辦單位因賠、提出民、刑事訴訟或主張任何法律上之權利，參賽者應賠償主辦單位因此所生之全部損失與費用。此所生之全部損失與費用。',
  '參賽者如因參加本活動或因活動獎項而遭受任何損失，主辦單位不負任何責參賽者如因參加本活動或因活動獎項而遭受任何損失，主辦單位不負任何責任。一旦得獎者領取獎品後，若有遺失或被竊，主辦單位不發給任何證明或任。一旦得獎者領取獎品後，若有遺失或被竊，主辦單位不發給任何證明或補償。補償。',
  '本辦法若有其他未盡事宜，悉依主辦單位相關規定或解釋辦理，主辦單位保本辦法若有其他未盡事宜，悉依主辦單位相關規定或解釋辦理，主辦單位保有有最最終之解釋權。終之解釋權。',
  '參賽作品開放參觀民眾下載收藏'
];
